{
    "header_title": "Pasos para realizar un sistema en Spring Boot",
    "header_image": "/data/springboot/spring-boot.png",
    "title": "Creaci칩n de la base de datos",
    "author": "Ing. Abel HZO",
    "content": [
        {
            "subtitle": "游닇 Revisando bases de datos",
            "text": "El primer paso que haremos ser치 crear la base de datos bajo el usuario de root en nuestra base de datos en MySQL.<br><br>Anteriormente ya hab칤amos asignado el password de <b>admin</b> al momento de la instalaci칩n de la base de datos.<br><br>Tambi칠n podemos ver las bases de datos que se encuentran tecleando <b>SHOW DATABASES;</b>",
            "image": {
                "src": "/data/springboot/4_creacion_de_la_bd/resources/image1.png",
                "maxwidth": "700px"
            }
        },
        {
            "subtitle": "游닇 Crear una base de datos",
            "text": "Ahora crearemos una base de datos para simular el registro de productos que se mostrar치n en un sistema web. Habr치 tres roles para los usuarios; estos ser치n:<br><br><b>USER:</b> El cual solo podr치 consultar los productos.<br><b>ADMIN:</b> El cual podr치 dar de alta un nuevo producto.<br><b>SU:</b> El cual podr치 hacer operaciones CRUD en todas las tablas.",
            "code": {
                "path": "/data/springboot/4_creacion_de_la_bd/resources/code1.sql.txt",
                "lang": "sql"
            }
        },
        {
            "subtitle": "游닇 Creando usuario para la base de datos",
            "text": "Una vez creada la base de datos, crearemos un usuario para que nuestra aplicaci칩n pueda trabajar con la base de datos que hemos creado con el fin de administrar los permisos.",
            "code": {
                "path": "/data/springboot/4_creacion_de_la_bd/resources/code2.sql.txt",
                "lang": "sql"
            }
        },
        {
            "subtitle": "游닇 Agregando permisos al usuario",
            "text": "Agregamos los permisos con la sentencia GRANT a todas las tablas de la base de datos y solo pondremos permisos para INSERT, DELETE, SELECT y UPDATE.",
            "code": {
                "path": "/data/springboot/4_creacion_de_la_bd/resources/code3.sql.txt",
                "lang": "sql"
            }
        },
        {
            "subtitle": "游닇 Comprobamos el acceso con el usuario",
            "text": "Realizamos una comprobaci칩n para ver si ya podemos acceder con el nuevo usuario que hemos creado.",
            "image": {
                "src": "/data/springboot/4_creacion_de_la_bd/resources/image2.png",
                "maxwidth": "700px"
            }
        },
        {
            "subtitle": "游닇 Como eliminar un usuario de mysql",
            "text": "Tambi칠n hay que mencionar que, para eliminar un usuario, necesitamos ejecutar la sentencia DROP.",
            "code": {
                "path": "/data/springboot/4_creacion_de_la_bd/resources/code4.sql.txt",
                "lang": "sql"
            }
        },
        {
            "subtitle": "游닇 Insertando registros de prueba",
            "text": "Ahora vamos a insertar algunos registros de prueba, para poder ver funcionar nuestro servicio REST, y tambi칠n agregaremos un usuario para poder autenticarnos en nuestro sistema.<br><br>Ya teniendo el sistema, guardaremos las im치genes de los productos dentro de la tabla. En esta ocasi칩n quise guardarlas dentro de una tabla para ver la din치mica de inserci칩n de un campo tipo BLOB, pero muchas veces es conveniente almacenar las im치genes en un servidor y solo guardar la URL en la base de datos.",
            "code": {
                "path": "/data/springboot/4_creacion_de_la_bd/resources/code5.sql.txt",
                "lang": "sql"
            }
        },
        {
            "text": "Es muy importante mencionar que se tiene que especificar el tama침o de los archivos que aceptara la base de datos en el archivo de configuraci칩n \"my.ini\" el atributo \"max_allowed_packet\" que por default viene 1M.<br><br>[mysqld]<br>max_allowed_packet = 10M<br><br>Y tambien resaltar que existen los tipos de datos:<br><br><b>TINYBLOB:</b> maximum length of 255 bytes<br><b>BLOB:</b> maximum length of 65,535 bytes<br><b>MEDIUMBLOB:</b> maximum length of 16,777,215 bytes<br><b>LONGBLOB:</b> maximum length of 4,294,967,295 bytes<br><br>En el cual nosotros utilizaremos MEDIUMBLOB para aceptar archivo de 16MB."
        }
    ]
}